Table_isTable
  extensions [ table ]
  globals [glob1]
  table:is-table? 0 => false
  table:is-table? [1 2 3] => false
  table:is-table? "hello" => false
  table:is-table? table:make => true
  table:is-table? table:to-list table:make => false

TablesBasics
  extensions [ table ]
  globals [glob1]
  O> set glob1 table:make
  (word glob1) => "{{table: []}}"
  O> table:put glob1 0 "testvalue"
  O> table:put glob1 "testkey" 1
  table:length glob1 => 2
  table:get glob1 "testkey" => 1
  table:get glob1 0 => "testvalue"
  table:keys glob1 => [0 "testkey"]
  table:has-key? glob1 0 => true
  table:has-key? glob1 3 => false
  table:has-key? glob1 "testkey" => true
  table:has-key? glob1 "somestring" => false
  O> table:clear glob1
  table:length glob1 => 0

TablesToFromList
  extensions [ table ]
  globals [glob1 glob2]
  O> set glob1 [[1 2] ["key" "value"]]
  O> set glob2 table:from-list glob1
  (word glob2) => "{{table: [[1 2] [\"key\" \"value\"]]}}"
  table:get glob2 "key" => "value"
  table:get glob2 1 => 2
  glob1 = table:to-list glob2 => true
  O> set glob1 table:make
  table:to-list glob1 => []

TableGet
  extensions [ table ]
  globals [glob1]
  O> set glob1 table:from-list [[[1 2] 1] [[3 4] 2]]
  table:get glob1 [1 2] => 1

TablesOfTables
  extensions [ table ]
  globals [glob1]
  O> set glob1 table:from-list ( list (list 0 table:from-list [[1 2] [3 4]]) )
  (word glob1) => "{{table: [[0 {{table: [[1 2] [3 4]]}}]]}}"

TableValues
  extensions [ table ]
  globals [ t ]
  O> set t table:make
  table:values t => []
  O> table:put t 1 "a"
  table:values t => ["a"]
  O> table:put t 2 "b"
  table:values t => ["a" "b"]
  O> table:put t list 1 2 -1
  table:values t => ["a" "b" -1]
  O> table:put t "a" "testing values"
  table:values t => ["a" "b" -1 "testing values"]
  O> table:remove t 2
  table:values t => ["a" -1 "testing values"]
  O> table:put t -1 -1
  table:values t => ["a" -1 "testing values" -1]

TableHasKeys
  extensions [ table ]
  globals [glob1]
  O> set glob1 table:from-list [[[1] 1] [2 2]]
  table:has-key? glob1 [2] => false
  table:has-key? glob1 [1] => true
  table:has-key? glob1 2 => true

TableKeys
  extensions [ table ]
  globals [ t ]
  O> set t table:make
  table:keys t => []
  O> table:put t 1 "a"
  table:keys t => [1]
  O> table:put t 2 "b"
  table:keys t => [1 2]
  O> table:put t list 1 2 -1
  table:keys t => [1 2 [1 2]]
  O> table:put t "testing values" "a"
  table:keys t => [1 2 [1 2] "testing values"]
  O> table:remove t [1 2]
  table:keys t => [1 2 "testing values"]
  O> table:put t -1 -1
  table:keys t => [1 2 "testing values" -1]

TableCounts
  extensions [ table ]
  globals [ ls glob1 ]
  O> set ls [1 1 2 3 3]
  (word table:counts ls) => "{{table: [[1 2] [2 1] [3 2]]}}"
  (word table:counts ["a" 0 "a" 4 [5] [5]]) => "{{table: [[\"a\" 2] [0 1] [4 1] [[5] 2]]}}"

TableGetOrDefault
  extensions [ table ]
  table:get-or-default (table:from-list [[1 2]]) 1 3 => 2
  table:get-or-default (table:from-list [[1 2]]) 2 3 => 3
